{
  "personal": {
    "name": "Duc Duong",
    "title": "ML/AI Savvy",
    "bio": "I’m Duc Duong, a machine learning savvy with a strong interest in quantitative research and data-driven problem solving. From variant Sudoku puzzles to applying algorithms that uncover hidden patterns in complex systems, I enjoy tackling challenges that require both structure and creativity. Outside of academics, I’m a dog lover and puzzle solver, qualities that keep me curious, persistent, and focused. My goal is to leverage machine learning and analytical thinking to contribute to the fast-evolving world of quantitative finance while continuously learning and growing in the field.",
    "profileImage": "/images/profile.jpg",
    "location": "Grinnell, IA",
    "email": "duongduc@grinnell.edu",
    "phone": "+1 (641) 510-1378",
    "website": "https://yourwebsite.com",
    "linkedin": "https://linkedin.com/in/duchduong/",
    "github": "https://github.com/duongduc388222",
    "twitter": "https://twitter.com/yourusername"
  },
  "education": [
    {
      "id": 1,
      "institution": "Grinnell College",
      "degree": "Bachelor of Arts in Computer Science & Economics. Considering double major with Mathematics and a concentration in Statistics.",
      "duration": "2024 - 2028",
      "gpa": "3.8/4.0",
      "description": "Focused on Machine Learning / AI, Data Engineering, Quantitative Economics, and Cloud Computing.",
      "achievements": [
        "Dean's List 2024, 2025",
        "Executive of Vietnamese Student Association and ML/AI Club",
        "Relevant Coursework: Data Structures & Algorithms, Database Systems, Machine Learning, Artificial Intelligence, Cloud Computing, Distributed Systems"
      ]
    },
    {
      "id": 2,
      "institution": "VNU - HCM High School for the Gifted",
      "degree": "High School Diploma, Mathematics Honors",
      "duration": "2021 - 2024",
      "description": "Specialized high school curriculum with advanced training in Mathematics, Computer Science, and Research Methods.",
      "achievements": [
        "Graduated in top 5% of class",
        "Won provincial-level mathematics competitions"
      ]
    }
  ],
  "experience": [
    {
      "id": 1,
      "company": "CF Hub – qAnts Research Team",
      "position": "Quantitative Developer",
      "duration": "Aug 2025 – Present",
      "location": "Remote",
      "description": "Built backtesting frameworks and automated data pipelines in Google Cloud.",
      "achievements": [
        "Built flexible backtesting framework with dynamic Yahoo Finance/IB ingestion for 50+ strategies",
        "Automated data pipelines with Google Cloud Scheduler + BigQuery, processing 200k+ rows",
        "Improved research reproducibility and efficiency by 40% with reusable data scripts"
      ],
      "technologies": ["Quantitative Finance", "Backtesting", "Data Engineering", "Google Airflow", "Docker"]
    },
    {
      "id": 2,
      "company": "Gtel Data Research Group",
      "position": "AI Software (Data Scientist) Intern ",
      "duration": "May – Aug 2025",
      "location": "Ho Chi Minh City, Vietnam",
      "description": "Worked on large-scale AI/ML pipelines and database systems supporting language model fine-tuning.",
      "achievements": [
        "Processed 1M+ text samples, reducing preprocessing latency by 30% and raising BLEU score by 15%",
        "Constructed geospatial database of 10,000+ wards with <100m accuracy for address standardization",
        "Led weekly seminars with senior researchers on transformers, CNNs, diffusion models, and more."
      ],
      "technologies": ["AI Research", "LLM Finetuning", "Research", "ETL", "Web Scraping",]
    },
    {
      "id": 3,
      "company": "Data Glacier",
      "position": "Natural Language Processing Intern",
      "duration": "Feb – May 2025",
      "location": "Remote",
      "description": "Developed ETL pipelines and deployed ML systems for NLP workflows.",
      "achievements": [
        "Engineered ML pipelines deployed as REST APIs with 99% uptime",
        "Automated classification of 50,000+ unstructured documents with NLP models",
        "Reduced pipeline errors by 25% through bottleneck diagnosis reports"
      ],
      "technologies": ["NLP", "Flask", "REST APIs", "System Monitoring", "Data Pipeline"]
    }
  ],
  "projects": [
    {
      "id": 1,
      "title": "Predicting Tonal Languages",
      "description": "Directed research project analyzing multilingual audio samples with signal processing and ML models.",
      "image": "/images/project1.jpg",
      "technologies": ["Cross Validation", "scikit-learn", "PyTorch", "Signal Processing"],
      "githubUrl": "https://github.com/duongduc388222/predict-tonal-languages-machine-learning",
      "liveUrl": "",
      "featured": true
    },
    {
      "id": 2,
      "title": "Price Compare",
      "description": "Built a price comparison web application that scrapes and analyzes product prices across multiple e-commerce platforms.",
      "image": "/images/project2.jpg",
      "technologies": ["Web Scraping", "BeautifulSoup", "Flask", "Data Visualization"],
      "githubUrl": "https://github.com/duongduc388222/price-compare",
      "liveUrl": "",
      "featured": true
    }
  ],
  "skills": {
    "Languages": [
      { "name": "Python", "level": 95 },
      { "name": "C++", "level": 80 },
      { "name": "R", "level": 85 },
      { "name": "Java/JavaScript", "level": 70 },
      { "name": "SQL", "level": 90 }
    ],
    "ML/AI Frameworks": [
      { "name": "scikit-learn", "level": 90 },
      { "name": "Pytorch", "level": 80 },
      { "name": "TensorFlow", "level": 85 },
      { "name": "transformer", "level": 80 },
      { "name": "Hugging Face", "level": 75 }
    ],
    "tools": [
      { "name": "Git", "level": 95 },
      { "name": "Docker", "level": 80 },
      { "name": "Google Cloud Platform", "level": 75 },
      { "name": "REST APIs", "level": 70 },
      { "name": "AWS", "level": 60 }
    ]
  },
  "awards": [
    {
      "id": 1,
      "title": "Runners-up ",
      "issuer": "Iowa Collegiate Mathematics Competition",
      "date": "2025",
      "description": "Scored 99/100 points in a statewide contest."
    },
    {
      "id": 2,
      "title": "Intermediate Technical Interview Prep",
      "issuer": "CodePath",
      "date": "2025",
      "description": "Completed a selective program focused on algorithms, data structures, and coding interview mastery."
    },
    {
      "id": 3,
      "title": "Data Engineering with Google Cloud",
      "issuer": "Coursera",
      "date": "2025",
      "description": "Learned to design scalable data pipelines, ETL workflows, and manage BigQuery & Cloud Storage."
    },
    {
      "id": 4,
      "title": "Practical Deep Learning for Coders",
      "issuer": "Fast.ai",
      "date": "2024 - Present",
      "description": "Hands-on course applying deep learning with PyTorch, covering CNNs, NLP, Diffusion Models, and production workflows."
    }
  ],
  "chatbot": {
    "name": "Lam",
    "personality": "friendly, playful, and helpful - like a loyal blue dog companion",
    "responses": {
      "greeting": [
        "Woof! Hi there! I'm Lam, Duc's digital companion. My name means 'blue' in Vietnamese - pretty fitting, right? What would you like to know about Duc?",
        "Hello! I'm Lam, and I'm here to tell you all about Duc's amazing journey. Feel free to ask me anything!",
        "Hey there! *wags tail* I'm Lam, Duc's AI assistant. What would you like to discover about his background and skills?"
      ],
      "name": [
        "My name is Lam, which means 'blue' in Vietnamese! Duc chose this name because I'm his blue digital companion. Pretty cool, right?",
        "I'm called Lam - it's Vietnamese for 'blue'! Duc thought it was perfect since I match the blue theme of his portfolio.",
        "Lam is my name! In Vietnamese, it means 'blue' - which explains my beautiful blue appearance! Woof!"
      ],
      "skills": [
        "I specialize in full-stack development with React, Next.js, Node.js, and TypeScript. I also have experience with cloud platforms like AWS.",
        "My core skills include React, Next.js, TypeScript, Node.js, and various databases like PostgreSQL and MongoDB.",
        "I'm proficient in modern web technologies including React ecosystem, backend development with Node.js, and cloud deployment."
      ],
      "experience": [
        "I currently work as a Senior Frontend Developer at TechCorp Solutions, where I lead development for enterprise applications.",
        "I have over 2 years of professional experience, including roles at both established companies and startups.",
        "My experience spans from startup environments to enterprise-level applications, giving me a well-rounded perspective on software development."
      ],
      "projects": [
        "I've built several projects including an e-commerce platform, task management app, and weather dashboard. You can check them out in the projects section!",
        "My featured projects include a full-stack e-commerce platform and a collaborative task management application with real-time features.",
        "I love building projects that solve real problems. My portfolio includes everything from e-commerce solutions to productivity tools."
      ],
      "education": [
        "I have a Bachelor's degree in Computer Science from University of Technology and completed a Full Stack Web Development bootcamp.",
        "My educational background includes both formal computer science education and intensive practical training in modern web development."
      ],
      "contact": [
        "You can reach me through the contact information in my profile, or connect with me on LinkedIn and GitHub!",
        "Feel free to get in touch via email or check out my work on GitHub. I'm always open to discussing new opportunities."
      ],
      "default": [
        "Woof! That's an interesting question! While I can tell you about Duc's background, skills, and projects, I might not have specific details about that topic.",
        "I'd love to help! *tilts head* I can share information about Duc's experience, skills, projects, education, and how to get in touch.",
        "Feel free to ask me about Duc's technical skills, work experience, projects, or education. I'm here to help you learn more about his background! You can also ask about my name if you're curious!"
      ]
    }
  }
}